{
  "difficulty_level3": [
    "如何利用杠杆原理制作一个简易的省力撬棍？",
    "生活中哪些工具运用了滑轮组原理，举例说明其省力效果？",
    "在家庭种植中，如何根据光合作用原理调整植物的光照时长？",
    "怎样利用热胀冷缩原理解决玻璃瓶瓶盖难以打开的问题？",
    "厨房中如何利用乳化原理制作稳定的沙拉酱？",
    "如何运用浮力原理自制一个简易的鸡蛋浮沉实验装置？",
    "在衣物清洗中，如何根据表面活性剂的作用选择合适的洗涤剂？",
    "怎样利用电流的热效应制作一个简易的加热保温装置？",
    "家庭养花时，如何根据植物的蒸腾作用原理合理浇水？",
    "如何运用光的反射原理制作简易的潜望镜？",
    "在食品保存中，如何根据呼吸作用原理延长蔬菜水果的保鲜期？",
    "怎样利用摩擦力原理增大鞋底的防滑性能，举例说明具体方法？",
    "如何根据酸碱中和原理处理被蚊虫叮咬后的红肿瘙痒？",
    "家庭清洁中，如何利用活性炭的吸附作用去除冰箱异味？",
    "怎样运用杠杆平衡原理校准简易的体重秤？",
    "如何根据惯性原理解释乘车时系安全带的必要性及正确方法？",
    "在手工制作中，如何利用毛细现象让颜料均匀渗透纸张？",
    "怎样利用电磁感应原理制作简易的手摇发电装置？",
    "厨房烹饪中，如何根据导热性原理选择合适的锅具材质？",
    "如何根据植物的向光性原理调整盆栽摆放位置促进均匀生长？",
    "生活中如何利用凝华和升华原理制作简易的人工“霜”？",
    "怎样根据压强原理设计一个省力的钉钉子辅助工具？",
    "在摄影中，如何利用光的折射原理调整相机焦距拍摄清晰画面？",
    "家庭养鱼时，如何根据气体溶解度原理增加水中的溶氧量？",
    "如何运用化学变化和物理变化的区别判断食物是否变质？",
    "怎样利用重心原理制作一个稳定的不倒翁玩具？",
    "在农业种植中，如何根据土壤酸碱度原理改良酸性土壤？",
    "如何根据电流的磁效应制作简易的电磁继电器模型？",
    "厨房中如何利用渗透压原理腌制咸菜并缩短入味时间？",
    "怎样利用光的色散原理制作简易的彩虹实验装置？",
    "家庭急救中，如何根据血液循环原理实施正确的止血方法？",
    "如何根据弹性形变原理选择合适的材料制作防震包装？",
    "在洗衣时，如何根据扩散原理让洗衣液更好地溶解于水？",
    "怎样利用杠杆原理调整自行车刹车的松紧程度？",
    "如何根据光合作用和呼吸作用的平衡计算植物的净光合速率？",
    "生活中如何利用热传递的三种方式（传导/对流/辐射）高效取暖？",
    "怎样根据浮力原理判断物体的空心或实心状态？",
    "在手工印染中，如何利用吸附作用让染料更好地附着在布料上？",
    "如何根据欧姆定律计算家庭电路中电器的额定电流？",
    "厨房烹饪中，如何根据沸点与气压的关系解释高压锅的工作原理？",
    "怎样利用光的直线传播原理制作简易的小孔成像装置？",
    "家庭养花时，如何根据根的向地性原理正确移栽植物？",
    "如何根据摩擦力的利弊设计鞋底的花纹图案？",
    "在食品加工中，如何利用发酵原理制作面包和馒头？",
    "怎样利用电磁感应原理解释发电机的工作过程及能量转化？",
    "如何根据酸碱指示剂的变色原理自制简易的酸碱测试剂？",
    "生活中如何利用惯性原理搬运易碎物品并减少破损？",
    "怎样根据毛细现象设计植物的自动浇水装置？",
    "在摄影中，如何利用光的反射原理避免拍摄时的强光反光？",
    "家庭清洁中，如何根据溶解原理去除不同类型的污渍（油/墨/锈）？",
    "如何根据杠杆原理设计一个简易的垃圾分类称重装置？",
    "怎样利用热胀冷缩原理检测家庭水管是否存在漏水问题？",
    "在农业中，如何根据蒸腾作用原理选择合适的时间进行灌溉？",
    "如何根据电流的热效应计算电暖器的额定功率和耗电量？",
    "厨房中如何利用乳化原理去除餐具上的油污？",
    "怎样利用浮力原理设计一个简易的水位监测装置？",
    "生活中如何根据光合作用原理选择蔬菜大棚的覆盖材料？",
    "如何根据光的折射原理解释筷子在水中“弯折”的现象？",
    "在手工制作中，如何利用重心原理调整风筝的平衡使其稳定飞行？",
    "怎样利用摩擦力原理设计一个简易的防滑垫？",
    "家庭养花时，如何根据土壤的保水性原理选择花盆的材质？",
    "如何根据酸碱中和原理改良碱性土壤并选择合适的肥料？",
    "怎样利用电磁感应原理制作简易的金属探测器？",
    "在食品保存中，如何根据低温抑制微生物生长的原理设计冷藏方案？",
    "如何根据杠杆原理调整天平的平衡并进行精准称重？",
    "生活中如何利用热传递原理选择合适的保温材料制作保温杯？",
    "怎样利用光的色散原理解释彩虹的形成条件和颜色顺序？",
    "在摄影中，如何利用光的反射原理补光拍摄暗部细节？",
    "家庭养鱼时，如何根据渗透压原理调整水中的盐度？",
    "如何根据电流的磁效应制作简易的电磁铁？",
    "厨房烹饪中，如何根据导热性原理合理搭配锅具和炉灶？",
    "怎样利用毛细现象解释毛巾吸水的过程及原理？",
    "在农业种植中，如何根据植物的向水性原理促进根系生长？",
    "如何根据惯性原理设计汽车的安全带和安全气囊系统？",
    "生活中如何利用吸附作用去除新装修房间的甲醛异味？",
    "怎样利用浮力原理计算不规则物体的体积？",
    "家庭清洁中，如何根据表面活性剂的作用去除衣物上的顽固污渍？",
    "如何根据杠杆原理设计一个简易的书架置物架？",
    "怎样利用热胀冷缩原理制作简易的温度计？",
    "在手工制作中，如何利用弹性形变原理制作简易的弹簧测力计？",
    "如何根据光合作用原理计算蔬菜大棚的最佳光照强度？",
    "生活中如何利用光的直线传播原理测量建筑物的高度？",
    "怎样利用摩擦力原理解释轮胎花纹对行车安全的影响？",
    "家庭养花时，如何根据呼吸作用原理避免花盆积水烂根？",
    "如何根据酸碱指示剂的变色原理检测雨水的酸碱度？",
    "怎样利用电磁感应原理解释变压器的工作原理？",
    "在食品加工中，如何利用凝固原理制作豆腐和果冻？",
    "如何根据杠杆原理设计一个简易的开瓶器？",
    "生活中如何利用热传递原理快速解冻冷冻食品？",
    "怎样利用光的反射原理制作简易的太阳能热水器？",
    "在摄影中，如何利用光的折射原理拍摄水下物体的清晰图像？",
    "家庭养鱼时，如何根据气体溶解度原理选择合适的增氧设备？",
    "如何根据电流的热效应设计简易的电烙铁？",
    "厨房中如何利用发酵原理制作酸奶和泡菜？",
    "怎样利用毛细现象设计植物的无土栽培装置？",
    "在农业中，如何根据压强原理设计灌溉系统的喷头？",
    "如何根据惯性原理解释跳远运动员助跑的作用？",
    "生活中如何利用吸附作用净化饮用水？",
    "怎样利用浮力原理设计一个简易的救生圈？",
    "家庭清洁中，如何根据酸碱中和原理去除水垢和尿垢？",
    "如何根据杠杆原理设计一个简易的儿童跷跷板？",
    "怎样利用热胀冷缩原理解释铁轨之间预留缝隙的原因？",
    "在手工制作中，如何利用重心原理制作稳定的纸飞机？",
    "如何根据光合作用原理选择室内植物的摆放位置？",
    "生活中如何利用光的反射原理制作简易的反光镜？",
    "怎样利用摩擦力原理设计一个简易的传送带？",
    "家庭养花时，如何根据植物的向肥性原理合理施肥？",
    "如何根据电流的磁效应制作简易的门铃？",
    "厨房烹饪中，如何根据沸点原理选择不同的烹饪方式（蒸/煮/炖）？",
    "怎样利用浮力原理解释轮船浮在水面的原因？",
    "在食品保存中，如何根据脱水原理制作干货和腊肉？",
    "如何根据杠杆原理设计一个简易的窗帘拉杆？",
    "生活中如何利用热传递原理选择合适的烹饪器具？",
    "怎样利用光的色散原理制作简易的三棱镜实验装置？",
    "在摄影中，如何利用光的直线传播原理拍摄剪影效果？",
    "家庭养鱼时，如何根据微生物分解原理建立鱼缸的生态系统？",
    "如何根据欧姆定律选择合适的保险丝规格？",
    "厨房中如何利用乳化原理制作奶油和冰淇淋？",
    "怎样利用毛细现象解释植物根系吸水的过程？",
    "在农业种植中，如何根据光合作用原理合理密植作物？",
    "如何根据惯性原理解释汽车刹车时人向前倾的现象？",
    "生活中如何利用吸附作用去除衣物上的异味？",
    "怎样利用浮力原理设计一个简易的密度计？",
    "家庭清洁中，如何根据溶解原理选择合适的溶剂去除油漆污渍？",
    "如何根据杠杆原理设计一个简易的置物挂钩？",
    "怎样利用热胀冷缩原理制作简易的自动浇水装置？",
    "在手工制作中，如何利用弹性形变原理制作简易的弹力球？",
    "如何根据光合作用原理解释合理施肥对作物产量的影响？",
    "生活中如何利用光的折射原理制作简易的放大镜？",
    "怎样利用摩擦力原理解释鞋底磨损的原因及防滑措施？",
    "家庭养花时，如何根据土壤的透气性原理选择盆土的配比？",
    "如何根据酸碱中和原理处理酸性废水？",
    "怎样利用电磁感应原理制作简易的扬声器？",
    "在食品加工中，如何利用膨化原理制作爆米花和薯片？",
    "如何根据杠杆原理设计一个简易的文件架？",
    "生活中如何利用热传递原理制作简易的保温箱？",
    "怎样利用光的反射原理解释镜子成像的特点？",
    "在摄影中，如何利用光的色散原理拍摄多彩的光影效果？",
    "家庭养鱼时，如何根据水温对鱼类的影响原理调整鱼缸温度？",
    "如何根据电流的热效应制作简易的电热毯？",
    "厨房中如何利用渗透压原理制作果脯和蜜饯？",
    "怎样利用毛细现象设计简易的墨水笔？",
    "在农业中，如何根据植物的顶端优势原理进行整枝打杈？",
    "如何根据惯性原理设计体育器材（如铅球、标枪）的投掷技巧？",
    "生活中如何利用吸附作用去除冰箱中的霉菌异味？",
    "怎样利用浮力原理解释潜水艇的上浮和下沉原理？",
    "家庭清洁中，如何根据表面活性剂的作用清洁油烟机的油污？",
    "如何根据杠杆原理设计一个简易的花盆升降架？",
    "怎样利用热胀冷缩原理解释热气球的飞行原理？",
    "在手工制作中，如何利用重心原理制作稳定的笔筒？",
    "如何根据光合作用原理选择植物的补光灯光谱？",
    "生活中如何利用光的直线传播原理解释影子的形成？",
    "怎样利用摩擦力原理设计一个简易的防滑手套？",
    "家庭养花时，如何根据植物的休眠期原理调整养护方案？",
    "如何根据酸碱指示剂的变色原理检测土壤的酸碱度？",
    "怎样利用电磁感应原理制作简易的发电机模型？",
    "在食品保存中，如何根据真空包装原理延长食品保质期？",
    "如何根据杠杆原理设计一个简易的工具架？",
    "生活中如何利用热传递原理快速冷却热水？",
    "怎样利用光的反射原理制作简易的反光背心？",
    "在摄影中，如何利用光的折射原理调整拍摄角度避免眩光？",
    "家庭养鱼时，如何根据水质的酸碱度原理选择合适的鱼类？",
    "如何根据电流的磁效应制作简易的电磁起重机模型？",
    "厨房烹饪中，如何根据导热性原理选择合适的锅铲材质？",
    "怎样利用毛细现象解释蜡烛燃烧时蜡油上升的过程？",
    "在农业种植中，如何根据植物的共生关系原理进行间作套种？",
    "如何根据惯性原理解释篮球反弹的高度与初速度的关系？",
    "生活中如何利用吸附作用去除水中的杂质？",
    "怎样利用浮力原理设计一个简易的水上漂浮平台？",
    "家庭清洁中，如何根据酸碱中和原理去除衣物上的汗渍？",
    "如何根据杠杆原理设计一个简易的儿童秋千？",
    "怎样利用热胀冷缩原理解释瓶装饮料不能装满的原因？",
    "在手工制作中，如何利用弹性形变原理制作简易的橡皮筋动力小车？",
    "如何根据光合作用原理计算植物的生长周期？",
    "生活中如何利用光的反射原理制作简易的太阳能灶？",
    "怎样利用摩擦力原理解释登山鞋的鞋底设计原理？",
    "家庭养花时，如何根据植物的开花习性原理调整光照和温度？",
    "如何根据电流的热效应计算电水壶的烧水时间？",
    "厨房中如何利用发酵原理制作米酒和啤酒？",
    "怎样利用毛细现象设计简易的纸巾吸水实验装置？",
    "在农业中，如何根据压强原理设计深耕犁的结构？",
    "如何根据惯性原理解释乒乓球旋转的轨迹变化？",
    "生活中如何利用吸附作用去除空气中的灰尘？",
    "怎样利用浮力原理计算物体的密度？",
    "家庭清洁中，如何根据溶解原理去除玻璃上的胶渍？",
    "如何根据杠杆原理设计一个简易的书架隔板？",
    "怎样利用热胀冷缩原理制作简易的报警装置？",
    "在手工制作中，如何利用重心原理制作稳定的台灯底座？",
    "如何根据光合作用原理选择蔬菜的种植时间？",
    "生活中如何利用光的折射原理解释海市蜃楼的形成？",
    "怎样利用摩擦力原理解释拔河比赛的取胜技巧？",
    "家庭养花时，如何根据植物的耐寒性原理选择越冬措施？",
    "如何根据电流的磁效应制作简易的电磁感应灯？",
    "厨房中如何利用渗透压原理制作腌肉和咸鱼？",
    "怎样利用毛细现象解释油灯的灯芯吸油原理？",
    "在农业种植中，如何根据植物的化感作用原理选择伴生植物？",
    "如何根据惯性原理解释高尔夫球的飞行轨迹？",
    "生活中如何利用吸附作用去除宠物身上的异味？",
    "怎样利用浮力原理设计一个简易的水上救援装置？",
    "家庭清洁中，如何根据溶解原理去除衣物上的血渍？"
  ]
}